type Script = {
    name: 'James' | 'Sunmin';
    text: React.ReactNode;
}

export const script: Script[] = [
    {
        name: 'James',
        text: '안녕하세요! 프론트엔드 개발자 김선민님의 페이지에 오신 것을 환영합니다.',
    },
    {
        name: 'James',
        text: '이 페이지를 통해서 선민님에 대해 더 자세한 정보를 얻을 수 있도록 도와드리겠습니다.',
    },
    {
        name: 'James',
        text: '가장 먼저, 간단한 인터뷰를 준비했습니다.',
    },
    {
        name: 'James',
        text: '안녕하세요. 선민님! ',
    },
    {
        name: 'Sunmin',
        text: '넵, 안녕하세요!',
    },
    {
        name: 'James',
        text: '선민님은 어떤 개발자인가요?',
    },
    {
        name: 'Sunmin',
        text: '저는 프론트엔드 개발자로, 최근에는 React를 주로 사용하고 있습니다.',
    },
    {
        name: 'James',
        text: '최근에는? 그렇다면, 다른 것을 사용한 경험이 있나요?',
    },
    {
        name: 'Sunmin',
        text: '아 넵, 저는 Vue.js로 처음 프론트엔드 개발자의 길을 걸었고, Svelte, Flutter를 사용하여 간단한 작업을 한 적이 있습니다.',
    },
    {
        name: 'James',
        text: '그렇군요. 선민님은 혹시 전공자이신가요?',
    },
    {
        name: 'Sunmin',
        text: '아 아뇨. 저는 물리학을 전공했습니다.',
    },
    {
        name: 'James',
        text: '오 혹시 어쩌다가 개발자가 되셨나요?',
    },
    {
        name: 'Sunmin',
        text: '네, 물리학을 전공하면서 전산을 위해서 Python을 사용하는 수업을 듣다가 프로그래밍에 관심을 가지게 되었고, 혼자 공부도 하고, 학원도 다니면서 개발자를 준비했습니다.',
    },
    {
        name: 'James',
        text: '어떤점에 매력을 느끼게 되었나요?'
    },
    {
        name: 'Sunmin',
        text: '무엇인가 만들고, 바로 확인할 수 있다는 점에 매력을 느낀 것 같습니다.'
    },
    {
        name: 'James',
        text: '그렇군요. 어찌보면, 대학교에서 보낸 시간을 잃어버리고, 다시 시작해야하는 것인데, 두렵거나 하지는 않았나요?',
    },
    {
        name: 'Sunmin',
        text: '고민을 많이 했었습니다. 하지만, 평생 배워야하고, 더 많은 시간을 투자해야한 다면, 더 흥미를 느끼는 일에 투자하고 싶었습니다.',
    },
    {
        name: 'James',
        text: '큰 결심을 하셨군요. 그렇다면, 선민님은 앞으로 어떤 개발자가 되고 싶으신가요?',
    },
    {
        name: 'Sunmin',
        text: '흠...',
    },
    {
        name: 'Sunmin',
        text: '저는 프론트엔드 개발자로서는 당연히 더 많이 알고, UI/UX에 대한 고민도 많이 하는 개발자가 되고 싶어요.',
    },
    {
        name: 'Sunmin',
        text: '하지만, 소프트웨어를 개발하는 사람으로서 더 많은 것을 알고 싶어요. 가깝게는 백엔드나 데이터베이스부터 사업이나 디자인에 대해서도 배우고 싶어요.',
    },
    {
        name: 'Sunmin',
        text: '물론, 그것들을 모두 알기는 어렵겠지만, 협업을 하면서, 다양한 분야의 사람들과 소통하면서, 더 많은 것을 배우고 싶어요.',
    }
];